Import pandas library

In [105]:
import pandas as pd

Read and load CSV file in the memory

In [106]:
df=pd.read_csv("https://raw.githubusercontent.com/austin1018/IS362_Assignment7/main/movie%20rate.csv")

Change the column name from unnamed to User

In [107]:
df.rename(columns = {'Unnamed: 0': 'User'},inplace=True)

Unpivot the data to be a flat table and store it in a seperate dataframe, this is the preparation for normalization.

In [108]:
cdf=df.melt(id_vars='User',var_name='Movie',value_name='Rate').dropna()

Add the column for total by user and row for total by movie

In [109]:
df[""] = df.mean(axis=1)

In [110]:
df.loc["",1:7]= df.mean(axis=0).round(2)

<ipython-input-110-a41ec7a25e9d>:1: FutureWarning: Slicing a positional slice with .loc is not supported, and will raise TypeError in a future version.  Use .loc with labels or .iloc with positions instead.
  df.loc["",1:7]= df.mean(axis=0).round(2)

Show the average ratings for each user and each movie.

In [111]:
df

,User,The Guilty,The Addams Family 2,The Survivalist,The Card Counter,Intrusion,The Starling,
0,Joy,4.0,3.00,5.00,NaN,NaN,5.00,4.25
1,Jack,3.0,NaN,3.00,5.0,5.0,NaN,4.00
2,John,NaN,5.00,4.00,NaN,3.0,4.00,4.00
3,Jason,5.0,NaN,5.00,NaN,3.0,4.00,4.25
4,Mary,NaN,5.00,NaN,5.0,3.0,4.00,4.25
,NaN,4.0,4.33,4.25,5.0,3.5,4.25,NaN

Create a new pandas dataframe, with normalized ratings for each user.

In [113]:
cdf["Rate"]=(cdf["Rate"]-cdf["Rate"].min())/(cdf["Rate"].max()-cdf["Rate"].min())

Show the average ratings for each user.

In [123]:
DF_AggByUser=cdf.groupby(["User"]).mean()
DF_AggByMovie=cdf.groupby(["Movie"]).mean()

In [124]:
DF_AggByUser

        Rate
User
Jack   0.500
Jason  0.625
John   0.500
Joy    0.625
Mary   0.625

show the average ratings for each movie.

In [121]:
DF_AggByMovie.round(3)

                      Rate
Movie
Intrusion            0.250
The Addams Family 2  0.667
The Card Counter     1.000
The Guilty           0.500
The Starling         0.625
The Survivalist      0.625

###### Conclusion
Using the original scale may put more weights on the variables with a large range. In order to deal with this problem, we need to apply the technique of features rescaling to independent variables or features of data in the step of data pre-processing. In our case, the range of data is from 1 to 5. After normalized the rate, it is only from 0 to 1 which is easier for analysis.

(Extra Credit) Below are the code for showing the standardized ratings by user and movie.

In [127]:
df=pd.read_csv("https://raw.githubusercontent.com/austin1018/IS362_Assignment7/main/movie%20rate.csv")
df.rename(columns = {'Unnamed: 0': 'User'},inplace=True)
df_z_scaled=df.melt(id_vars='User',var_name='Movie',value_name='Rate').dropna()
df_z_scaled["Rate"] = (df_z_scaled["Rate"] - df_z_scaled["Rate"].mean()) / df_z_scaled["Rate"].std()

In [133]:
DF_Std_AggByUser=df_z_scaled.groupby(["User"]).mean().round(3)
DF_Std_AggByMovie=df_z_scaled.groupby(["Movie"]).mean().round(3)

In [134]:
DF_Std_AggByUser

        Rate
User
Jack  -0.171
Jason  0.114
John  -0.171
Joy    0.114
Mary   0.114

In [135]:
DF_Std_AggByMovie

                      Rate
Movie
Intrusion           -0.743
The Addams Family 2  0.210
The Card Counter     0.971
The Guilty          -0.171
The Starling         0.114
The Survivalist      0.114